rottenpotatoes/app/controllers/movies_controller.rb

  def find_by_same_director
      @movie = Movie.find params[:id]
    if @movie.director and !@movie.director.empty?
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'

  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering,@title_header = {:order => :title}, 'hilite'
    when 'release_date'
      ordering,@date_header = {:order => :release_date}, 'hilite'
    end
    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'NC-17', 'R')

  def create
    @movie = Movie.create!(params[:movie])
---
INSERT INTO "movies" ("created_at", "description", "director", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
UPDATE "movies" SET "director" = 'Ridley Scott', "updated_at" = '2016-03-27 20:52:58.044647' WHERE "movies"."id" = 3

  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy
---
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 2]]